[
  {
    "fact": "Urine contains over 3,000 compounds, including hormones, enzymes, and metabolic waste products."
  },
  {
    "fact": "The average adult bladder can hold about 400-600 milliliters of urine."
  },
  {
    "fact": "Urine is used in the production of fertilizer and can be an effective natural source of nitrogen, phosphorus, and potassium."
  },
  {
    "fact": "There is a condition called urinary incontinence, which is the inability to control urine flow voluntarily."
  },
  {
    "fact": "In ancient Rome, urine was used as a cleaning agent for clothing and even teeth whitening."
  },
  {
    "fact": "Urine is known to have been used as a mordant, a substance used to fix dyes to textiles."
  },
  {
    "fact": "Some animals, such as rats and mice, use urine to mark their territories and communicate with other members of their species."
  },
  {
    "fact": "Urine can be used as a primitive source of fuel. In World War II, Germany used urine-derived methane gas to power vehicles."
  },
  {
    "fact": "There is a medical condition called \"urophobia\" which is an irrational fear of urine."
  },
  {
    "fact": "Urine therapy, also known as urotherapy, is an alternative therapy where people consume their own urine for alleged health benefits."
  },
  {
    "fact": "Urine can be used to extinguish small fires, as its high water content helps cool and drown the flames."
  },
  {
    "fact": "Astronauts on the International Space Station (ISS) recycle their urine to produce drinking water using advanced filtration systems."
  },
  {
    "fact": "Some athletes believe that rubbing urine on their skin can improve their performance due to the presence of hormones and growth factors."
  },
  {
    "fact": "In some countries, urine-diverting toilets are used to collect urine separately from feces for use as a fertilizer."
  },
  {
    "fact": "Urine contains small amounts of vitamins, such as vitamin C, B vitamins, and trace amounts of vitamin D."
  },
  {
    "fact": "The smell of urine can be affected by certain medical conditions, such as diabetes or liver disease."
  },
  {
    "fact": "Urine is being studied as a potential source of stem cells, which have the ability to differentiate into various cell types in the body."
  },
  {
    "fact": "Ancient Romans used urine as a mouthwash, believing it had disinfectant properties."
  },
  {
    "fact": "Urine can be used to detect the presence of drugs or their metabolites in a person's system, making it a common tool in drug testing."
  },
  {
    "fact": "Some researchers believe that urine could be used to generate electricity through microbial fuel cells."
  },
  {
    "fact": "Urine has been used as an ingredient in the preparation of gunpowder due to its high nitrogen content."
  },
  {
    "fact": "In some countries, like Switzerland, there are urine-recycling programs where urine is collected from public toilets and used as fertilizer in agriculture."
  },
  {
    "fact": "Urine can contain small amounts of alcohol if consumed, as the body eliminates it through the urinary system."
  },
  {
    "fact": "Urine is naturally sterile when it leaves the body, making it a potential emergency wound cleaning agent."
  },
  {
    "fact": "There is a medical condition called \"polyuria\" which is characterized by excessive production of urine."
  },
  {
    "fact": "Urine has been used as a bleaching agent for fabric and paper, due to the presence of ammonia."
  },
  {
    "fact": "The Romans used to collect urine from public urinals and sell it as a valuable commodity for various purposes, including tanning leather."
  },
  {
    "fact": "Urine has been used in the production of gunpowder, as it contains saltpeter (potassium nitrate)."
  },
  {
    "fact": "Some ancient civilizations believed that urine had magical or spiritual properties and used it in religious rituals."
  },
  {
    "fact": "Urine can be used to test for pregnancy through the detection of the hormone human chorionic gonadotropin (hCG)."
  },
  {
    "fact": "There is a condition called \"hematuria\" which refers to the presence of blood in the urine."
  },
  {
    "fact": "Urine has been used as a method of tanning hides and skins to produce leather."
  },
  {
    "fact": "Urine has been used in the process of smelting metal ores, as it can help separate impurities from the desired metal."
  },
  {
    "fact": "There is a medical condition called \"oliguria\" which is characterized by abnormally low urine output."
  },
  {
    "fact": "Urine has been used as a hair rinse to remove buildup and enhance shine, although its effectiveness is questionable."
  },
  {
    "fact": "Urine can be used as an ingredient in certain cosmetic products, such as moisturizers and facial masks."
  },
  {
    "fact": "Some cultures have used urine to help treat jellyfish stings, as it can help neutralize the venom and relieve pain."
  },
  {
    "fact": "Urine has been used as a source of ammonia for cleaning and as a bleaching agent for cloth and textiles."
  },
  {
    "fact": "Certain medical conditions, such as kidney stones or urinary tract infections, can cause changes in urine color and composition."
  },
  {
    "fact": "Urine can be used as a natural pesticide to repel or deter pests from plants, due to its nitrogen content."
  },
  {
    "fact": "Urine contains a small amount of the neurotransmitter dopamine, which plays a role in the brain's reward and pleasure centers."
  },
  {
    "fact": "Some ancient cultures believed that urine had antiseptic properties and used it to clean wounds and prevent infection."
  },
  {
    "fact": "Urine is used in the production of certain medications, such as diuretics and hormone replacement therapies."
  },
  {
    "fact": "Urine has been used in the production of gunpowder since ancient times, as it provides a source of nitrogen."
  },
  {
    "fact": "Certain medical conditions, such as diabetes insipidus, can cause excessive thirst and frequent urination."
  }
]